{
  "format": "graph-model",
  "generatedBy": "2.12.0",
  "convertedBy": "TensorFlow.js Converter v4.5.0",
  "signature": {
    "inputs": {
      "input": {
        "name": "input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "1" },
            { "size": "3" },
            { "size": "224" },
            { "size": "224" }
          ]
        }
      }
    },
    "outputs": {
      "output": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "5" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "PartitionedCall/strided_slice/stack",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Const_102",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/PartitionedCall/split_76-folded-1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_232/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_77",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "48" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_154",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "48" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_233/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_235/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_78",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "48" },
                  { "size": "1152" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_156",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_236/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.15/_depthwise_conv/static_padding/Constant_8",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "ConstantFolding/PartitionedCall/split_71-folded-1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_217/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_72",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "48" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_144",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "48" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_218/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_220/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_73",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "48" },
                  { "size": "1152" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_146",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_221/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Constant_8",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_211/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_70",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "1152" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_140",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_212/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Concat",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Constant_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Where_30",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_60",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_30",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_60",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_61",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_61",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Const_92",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Shape_148",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_62",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_91",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_15",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_62",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Constant_6",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_93",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Transpose/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.14/_depthwise_conv/static_padding/Constant_7",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Where_31",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_63",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_31",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          }
        }
      },
      {
        "name": "PartitionedCall/zeros_62",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/zeros_63",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_95",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_214/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Reshape_30",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "5" },
                  { "size": "5" },
                  { "size": "1152" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_142",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_215/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_223/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/split_74",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "192" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_148",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_224/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/PartitionedCall/split_66-folded-1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_202/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_67",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "48" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_134",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "48" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_203/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_205/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_68",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "48" },
                  { "size": "1152" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_136",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_206/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Constant_8",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_196/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_65",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "1152" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_130",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_197/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Concat",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Constant_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Where_28",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_56",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_28",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_56",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_57",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_57",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Const_86",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Shape_138",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_58",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_85",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_14",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Cast_58",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Constant_6",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Const_87",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.13/_depthwise_conv/static_padding/Constant_7",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Where_29",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_59",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_29",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_58",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_59",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Const_89",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_199/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Reshape_28",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "5" },
                  { "size": "5" },
                  { "size": "1152" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_132",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_200/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_208/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_69",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "192" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_138",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_209/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/PartitionedCall/split_61-folded-1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_187/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_62",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1152" },
                  { "size": "48" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_124",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "48" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_188/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_190/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_63",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "48" },
                  { "size": "1152" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_126",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_191/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Constant_8",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/split_60",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "1152" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_120",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_182/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Concat",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Constant_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Where_26",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Cast_52",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_26",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_52",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_53",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_53",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Const_80",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/Shape_128",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_54",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_79",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_13",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_54",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Constant_6",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Const_81",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/_blocks.12/_depthwise_conv/static_padding/Constant_7",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Where_27",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{}, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_55",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_27",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } }
          }
        }
      },
      {
        "name": "PartitionedCall/zeros_54",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/zeros_55",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/Const_83",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_184/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Reshape_26",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "5" },
                  { "size": "5" },
                  { "size": "1152" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_122",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_185/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_193/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/split_64",
